# Discussion of SQL and Pandas

From my understanding, SQL and pandas are typically used in conjuction:

### SQL for Data Storage and Retrieval:

- Storage: SQL databases are used for storing and managing large datasets. They are highly efficient for storing structured data in a way that ensures data integrity and facilitates complex querying.
- Retrieval: SQL is used to retrieve subsets of data from the database. SQL queries can be used to perform complex joins, filters, and aggregations at the database level, which is particularly useful when dealing with very large datasets.

### Pandas for Data Manipulation and Analysis:

- Once the data is retrieved from the SQL database and loaded into a pandas DataFrame, you can leverage pandas for more detailed data manipulation and analysis.
- Pandas offers a wide range of functionalities for data cleaning, transformation, statistical analysis, and visualization, which are more flexible and user-friendly than SQL, especially for complex data manipulation tasks.

### Workflow in Industry:

- This workflow of using SQL for data storage and retrieval, combined with pandas for data manipulation and analysis, is common in many industries.
- It allows teams to leverage the strengths of both SQL (efficient data storage and retrieval) and pandas (flexible data manipulation and analysis).
- In many real-world scenarios, especially in big data environments, this workflow ensures that only the necessary data is transferred from the database, reducing memory usage and improving efficiency.

### Scalability and Performance:

- For very large datasets, it’s often more efficient to use SQL queries to perform initial filtering and aggregation in the database, as databases are optimized for these operations.
Pandas is then used for more complex or specific data transformations and analysis that are easier to implement in Python or not feasible in SQL.
- In summary, combining SQL with pandas is a normal and effective workflow in many data-driven industries. It allows professionals to harness the strengths of both tools, leading to more efficient and powerful data processing and analysis.

## Comment: In this page, we will query the data, so SQL codes are used. In python, we can use 'ipython-sql' with magic '%sql' and '%%sql' for single or multiple SQL queries.

In [ ]:
# install sql package in python
!pip install ipython-sql

In [ ]:
# psycopg2 is a PostgreSQL adapter for Python and is required for connecting to a PostgreSQL database using SQLAlchemy (which is what the %sql magic command in Jupyter Notebooks relies on).
!pip install psycopg2-binary

In [46]:
#load the sql module in jupyter notebook
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [47]:
#connect to my database (HIDDEN PASSWORD BY XXXXXXX)
%sql postgresql://postgres:Dylan1994@127.0.0.1:5432/sales_data

### NOTICE! the '%%sql' does not allow any text or comment in the same cell! So I wrote comment in markdown cell separately.

In [53]:
%%sql
SELECT * FROM dim_store_details LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
5 rows affected.

[(0, 0, None, None, 'WEB-1388012W', 325, datetime.date(2010, 6, 12), 'Web Portal', 'GB', 'Europe', None, None),
 (1, 1, 'Flat 72W\nSally isle\nEast Deantown\nE7B 8EB, High Wycombe', 'High Wycombe', 'HI-9B97EE4E', 34, datetime.date(1996, 10, 25), 'Local', 'GB', 'Europe', 51.62907, -0.74934),
 (2, 2, 'Heckerstraße 4/5\n50491 Säckingen, Landshut', 'Landshut', 'LA-0772C7B9', 92, datetime.date(2013, 4, 12), 'Super Store', 'DE', 'Europe', 48.52961, 12.16179),
 (3, 3, '5 Harrison tunnel\nSouth Lydia\nWC9 2BE, Westbury', 'Westbury', 'WE-1DE82CEE', 69, datetime.date(2014, 1, 2), 'Super Store', 'GB', 'Europe', 51.26, -2.1875),
 (4, 4, 'Studio 6\nStephen landing\nSouth Simon\nB77 2WA, Belper', 'Belper', 'BE-18074576', 35, datetime.date(2019, 9, 9), 'Local', 'GB', 'Europe', 53.0233, -1.48119)]

- It works!, now let's check the analytics questions and see how to query by SQL language
### Q1: How many stores does the bussiness have in which conutries?

In [64]:
%%sql
SELECT 
    country_code, count(*) AS store_nums
FROM 
    dim_store_details
GROUP BY 
    country_code
ORDER BY 
    store_nums DESC;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
3 rows affected.

[('GB', 266), ('DE', 141), ('US', 34)]

### Q2: Which locations have most stores?

In [66]:
%%sql
SELECT 
    locality, count(*) AS locality_nums
FROM 
    dim_store_details
GROUP BY 
    locality
ORDER BY 
    locality_nums DESC
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
5 rows affected.

[('Chapletown', 14),
 ('Belper', 13),
 ('Bushey', 12),
 ('Exeter', 11),
 ('Rutherglen', 10)]

### Q3: Which months produced the largest amount of sales?

In [67]:
%%sql
SELECT * FROM orders_table LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
5 rows affected.

[(0, 0, 0, UUID('9476f17e-5d6a-4117-874d-9cdb38ca1fa6'), UUID('93caf182-e4e9-4c6e-bebb-60a1a9dcf9b8'), '30060773296197', 'BL-8387506C', 'R7-3126933h', 3),
 (1, 1, 1, UUID('0423a395-a04d-4e4a-bd0f-d237cbd5a295'), UUID('8fe96c3a-d62d-4eb5-b313-cf12d9126a49'), '349624180933183', 'WEB-1388012W', 'C2-7287916l', 2),
 (2, 2, 2, UUID('65187294-bb16-4519-adc0-787bbe423970'), UUID('fc461df4-b919-48b2-909e-55c95a03fe6b'), '3529023891650490', 'CH-01D85C8D', 'S7-1175877v', 2),
 (3, 3, 3, UUID('579e21f7-13cb-436b-83ad-33687a4eb337'), UUID('6104719f-ef14-4b09-bf04-fb0c4620acb0'), '213142929492281', 'CL-C183BE4B', 'D8-8421505n', 2),
 (4, 4, 4, UUID('00ab86c3-2039-4674-b9c1-adbcbbf525bd'), UUID('9523a6d3-b2dd-4670-a51a-36aebc89f579'), '502067329974', 'SO-B5B9CB3B', 'B6-2596063a', 2)]

it seems the date_uuid is releated to another time where specific dates are recorded

In [73]:
%%sql
SELECT month, date_uuid FROM dim_date_times LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
5 rows affected.

[('8', UUID('58a47e39-6a6c-422e-a867-5c404b2afc51')),
 ('10', UUID('0f284b3f-d145-472a-beca-421a68733ba1')),
 ('7', UUID('ce4c2d75-d66c-4710-98c5-74ec86764556')),
 ('12', UUID('46eb96ac-65cd-449d-b489-ccdcfe3f6c46')),
 ('7', UUID('9379cf5a-1387-4c57-8c75-dcf61765d369'))]

In [96]:
%%sql
SELECT 
    month, 
    COUNT(*) AS month_sales, 
    SUM(orders_table.product_quantity*dim_products.product_price) AS total_money
FROM 
    orders_table
JOIN 
    dim_date_times ON orders_table.date_uuid = dim_date_times.date_uuid
JOIN
    dim_products ON orders_table.product_code = dim_products.product_code
GROUP BY 
    month
ORDER BY 
    total_money DESC;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
12 rows affected.

[('8', 10225, 673295.6799999983),
 ('1', 10249, 668041.4499999986),
 ('10', 10130, 657335.8399999985),
 ('5', 10150, 650321.4299999983),
 ('7', 10284, 645741.6999999993),
 ('3', 10119, 645462.9999999988),
 ('6', 9965, 635578.9899999986),
 ('12', 10119, 635329.0899999985),
 ('9', 9752, 633993.619999999),
 ('11', 9867, 630757.0799999988),
 ('4', 9755, 630022.7699999992),
 ('2', 9508, 616452.9899999986)]

### Q4: How many sales are coming from online?
Note the 'dim_store_details' have info about online or local which can be referred by storecode, and 'orders_table' contains info about sales and storecode

In [100]:
%%sql
SELECT 
    store_type, 
    COUNT(*) AS sales_type, 
    SUM(orders_table.product_quantity) AS total_products
FROM 
    dim_store_details
JOIN 
    orders_table on dim_store_details.store_code = orders_table.store_code
GROUP BY 
    store_type
ORDER BY 
    sales_type DESC;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
5 rows affected.

[('Local', 53894, 216277),
 ('Web Portal', 26957, 107739),
 ('Super Store', 18779, 75730),
 ('Mall Kiosk', 10762, 42805),
 ('Outlet', 9731, 39235)]

So the 'Web Portal' is the answer.

### Q5: What percetage of sales come through each type of store?
Based on Q4, we can just use each of the type divided by the total numbers

Notice, the SUM(orders_table.product_quantity)/SUM(SUM(orders_table.product_quantity)) OVER() AS percentage, apparently, the double SUM is the aggregation to count the whole numbers across the row. The OVER() is the window function that considers the sum up all the rows in the dataset. 

We cannot use two aggregation function SUM at the same time, but the window function can help.

In [103]:
%%sql
SELECT 
    store_type, 
    COUNT(*) AS sales_type, 
    SUM(orders_table.product_quantity) AS total_products,
    SUM(orders_table.product_quantity)/SUM(SUM(orders_table.product_quantity)) OVER() AS percentage
FROM 
    dim_store_details
JOIN 
    orders_table on dim_store_details.store_code = orders_table.store_code
GROUP BY 
    store_type
ORDER BY 
    sales_type DESC;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
5 rows affected.

[('Local', 53894, 216277, Decimal('0.44890677603749382506')),
 ('Web Portal', 26957, 107739, Decimal('0.22362418169062612861')),
 ('Super Store', 18779, 75730, Decimal('0.15718597053463570963')),
 ('Mall Kiosk', 10762, 42805, Decimal('0.08884650031341716032')),
 ('Outlet', 9731, 39235, Decimal('0.08143657142382717638'))]

### Q6: Which month in each year produce the hightest cost of sales?

This question refers to several tables, let us check each table first.

In [108]:
%%sql
SELECT * FROM orders_table LIMIT 1;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
1 rows affected.

[(0, 0, 0, UUID('9476f17e-5d6a-4117-874d-9cdb38ca1fa6'), UUID('93caf182-e4e9-4c6e-bebb-60a1a9dcf9b8'), '30060773296197', 'BL-8387506C', 'R7-3126933h', 3)]

In [115]:
%%sql
SELECT * FROM dim_products LIMIT 1;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
1 rows affected.

[(44, 44, 'Cra-Z-Compounds Kit', 12.99, 1.38, 'toys-and-games', '8936896386435', datetime.date(2000, 12, 4), UUID('3aae386b-ab35-4b3d-ae7d-8abe746e40e1'), True, 'q7-0232955R', 'LIGHT')]

In [113]:
%%sql
SELECT month, year, date_uuid FROM dim_date_times LIMIT 1;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
1 rows affected.

[('8', '1995', UUID('58a47e39-6a6c-422e-a867-5c404b2afc51'))]

So, we have to join 3 tables to know the quantity, price per quantity and date information for each sale.

In [120]:
%%sql
SELECT
    year,
    month,
    SUM(orders_table.product_quantity * dim_products.product_price) AS total_amount
From
    orders_table
JOIN dim_date_times ON
    orders_table.date_uuid = dim_date_times.date_uuid
JOIN dim_products ON
    orders_table.product_code = dim_products.product_code
GROUP BY 
    month, year
ORDER BY
    total_amount DESC
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
10 rows affected.

[('1994', '3', 27936.769999999986),
 ('2019', '1', 27356.139999999985),
 ('2009', '8', 27091.669999999987),
 ('1997', '11', 26679.97999999999),
 ('2018', '12', 26310.96999999999),
 ('2019', '8', 26277.719999999987),
 ('2017', '9', 26236.66999999999),
 ('2010', '5', 25798.119999999988),
 ('1996', '8', 25648.289999999986),
 ('2000', '1', 25614.539999999986)]

### Q7: What is the staff headcount?

In other words, to count the staff numbers in each country

In [123]:
%%sql
SELECT * FROM dim_store_details LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
5 rows affected.

[(0, 0, None, None, 'WEB-1388012W', 325, datetime.date(2010, 6, 12), 'Web Portal', 'GB', 'Europe', None, None),
 (1, 1, 'Flat 72W\nSally isle\nEast Deantown\nE7B 8EB, High Wycombe', 'High Wycombe', 'HI-9B97EE4E', 34, datetime.date(1996, 10, 25), 'Local', 'GB', 'Europe', 51.62907, -0.74934),
 (2, 2, 'Heckerstraße 4/5\n50491 Säckingen, Landshut', 'Landshut', 'LA-0772C7B9', 92, datetime.date(2013, 4, 12), 'Super Store', 'DE', 'Europe', 48.52961, 12.16179),
 (3, 3, '5 Harrison tunnel\nSouth Lydia\nWC9 2BE, Westbury', 'Westbury', 'WE-1DE82CEE', 69, datetime.date(2014, 1, 2), 'Super Store', 'GB', 'Europe', 51.26, -2.1875),
 (4, 4, 'Studio 6\nStephen landing\nSouth Simon\nB77 2WA, Belper', 'Belper', 'BE-18074576', 35, datetime.date(2019, 9, 9), 'Local', 'GB', 'Europe', 53.0233, -1.48119)]

In [136]:
%%sql
SELECT
    SUM(staff_numbers),
    country_code
FROM 
    dim_store_details
GROUP BY
    country_code

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
3 rows affected.

[(1384, 'US'), (13307, 'GB'), (6087, 'DE')]

### Q8: Which German store is selling the most?

Here is also a question considering multiple tables.

The major structure as we see from above and below examples indicate that we need to extract the main infos from a table, where the chosen table contains the key stored in other tables requiring the 'join' function to link different tables.

In [153]:
%%sql
SELECT
    dim_store_details.locality,   
    country_code,
    SUM(dim_products.product_price * orders_table.product_quantity) AS total_amount
FROM 
    orders_table
JOIN dim_products ON
    orders_table.product_code = dim_products.product_code
JOIN dim_store_details ON
    orders_table.store_code = dim_store_details.store_code
WHERE 
    dim_store_details.country_code = 'DE'
GROUP BY locality, country_code
ORDER BY total_amount DESC
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/sales_data
10 rows affected.

[('Landshut', 'DE', 121606.09000000032),
 ('Charlottenburg-Nord', 'DE', 107056.08000000019),
 ('Pfullingen', 'DE', 86838.29000000011),
 ('Radevormwald', 'DE', 73814.75000000003),
 ('Weimar', 'DE', 72135.90000000004),
 ('Albstadt', 'DE', 71103.60000000005),
 ('Ehingen', 'DE', 63656.439999999995),
 ('Verl', 'DE', 59348.82000000006),
 ('Stuttgart', 'DE', 58878.81000000001),
 ('Oberhausen', 'DE', 57714.77000000001)]

### Comments: 
The above questions are tyical SQL operations for retrive dataset and make simple analytics. After we filter the dataset, we can readily download the dataset for graph or machine learning analytics using Pandas, or integrated ML models, etc.